In [1]:
## UFuncs: Index Alignment
# index alignment in series
import pandas as pd
import numpy as np
rng = np.random.RandomState(0)

In [2]:
area = pd.Series({'Nairobi' : 1723337, 'Texas' : 695662,
                  'California' : 423967}, name='area')
population = pd.Series({'California' : 38332521, 'Texas' : 213414111,
                        'New York':34324342,}, name = 'population')
population / area

California     90.413926
Nairobi              NaN
New York             NaN
Texas         306.778451
dtype: float64

In [3]:
area.index | population.index

Index(['California', 'Nairobi', 'New York', 'Texas'], dtype='object')

In [4]:
# Index alignment in DataFrame
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

    A   B
0  12  15
1   0   3

In [5]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BCA'))
B

   B  C  A
0  3  7  9
1  3  5  2
2  4  7  6

In [6]:
A + B

      A     B   C
0  21.0  18.0 NaN
1   2.0   6.0 NaN
2   NaN   NaN NaN

In [7]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0  21.0  18.0  14.5
1   2.0   6.0  12.5
2  13.5  11.5  14.5

In [10]:
## Ufuncs: Operations Between DataFrame and Series
A = rng.randint(10, size=(3, 4))
A

array([[4, 3, 0, 3],
       [5, 0, 2, 3],
       [8, 1, 3, 3]])

In [11]:
A - A[0]

array([[ 0,  0,  0,  0],
       [ 1, -3,  2,  0],
       [ 4, -2,  3,  0]])

In [12]:
df = pd.DataFrame(A, columns=list('QRST'))
df

   Q  R  S  T
0  4  3  0  3
1  5  0  2  3
2  8  1  3  3

In [13]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  1  0 -3  0
1  5  0  2  3
2  7  0  2  2

In [14]:
halfrow = df.iloc[0, ::2]
halfrow

Q    4
S    0
Name: 0, dtype: int64

In [15]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  1.0 NaN  2.0 NaN
2  4.0 NaN  3.0 NaN